In [1]:
import pandas as pd
dict_info = {
    'name': ['Kim', 'Lee', 'Park'],
    'age': [25, 26, 27],
    'email': ['kim1345@gmail.com', 'lee1001@naver.com', 'park4050@snu.ac.kr']
}

In [2]:
df = pd.DataFrame(dict_info)

In [5]:
df.set_index('email')

                    name  age
email
kim1345@gmail.com    Kim   25
lee1001@naver.com    Lee   26
park4050@snu.ac.kr  Park   27

In [6]:
df

   name  age               email
0   Kim   25   kim1345@gmail.com
1   Lee   26   lee1001@naver.com
2  Park   27  park4050@snu.ac.kr

In [5]:
df.loc[1] = ['Song', 22, 'song1010@naver.com']

In [9]:
df.loc[1, 'email'] = 'song1011@nate.com'

In [10]:
df

   name  age               email
0   Kim   25   kim1345@gmail.com
1  Song   22   song1011@nate.com
2  Park   27  park4050@snu.ac.kr

In [15]:
filt = (df['email'] == 'song1011@nate.com')
df.loc[filt, 'name'] = 'Jae'

In [39]:
df

   name  age               email
0   Kim   25   kim1345@gmail.com
1   Jae   28   song1011@nate.com
2  Park   27  park4050@snu.ac.kr

In [41]:
df.apply(lambda x:x.min())

name                   Jae
age                     25
email    kim1345@gmail.com
dtype: object

In [44]:
df.applymap(__name__)

TypeError: 'str' object is not callable

In [49]:
df.name.map({'Kim': 'Lee', 'Jae': 'Jang'})

0     Lee
1    Jang
2     NaN
Name: name, dtype: object

In [51]:
df.name = df.name.replace({'Kim': 'Lee', 'Jae': 'Jang'})

In [3]:
df

   name  age               email
0   Kim   25   kim1345@gmail.com
1   Lee   26   lee1001@naver.com
2  Park   27  park4050@snu.ac.kr

In [4]:
df2 = pd.DataFrame({'last_name':['Jae Hi', 'Ku Heon', 'Sang Hyeon']})

In [5]:
df['full_name'] = df['name'] + ' ' + df2['last_name']

In [6]:
df

   name  age               email        full_name
0   Kim   25   kim1345@gmail.com       Kim Jae Hi
1   Lee   26   lee1001@naver.com      Lee Ku Heon
2  Park   27  park4050@snu.ac.kr  Park Sang Hyeon

In [8]:
df.drop(columns=['name'], inplace=True)
df

   age               email        full_name
0   25   kim1345@gmail.com       Kim Jae Hi
1   26   lee1001@naver.com      Lee Ku Heon
2   27  park4050@snu.ac.kr  Park Sang Hyeon

In [11]:
df['full_name'].str.split(expand=True)

      0     1      2
0   Kim   Jae     Hi
1   Lee    Ku   Heon
2  Park  Sang  Hyeon

In [12]:
df[['last_name', 'middle_name', 'first_name']] = df['full_name'].str.split(expand=True)

In [13]:
df

   age               email        full_name last_name middle_name first_name
0   25   kim1345@gmail.com       Kim Jae Hi       Kim         Jae         Hi
1   26   lee1001@naver.com      Lee Ku Heon       Lee          Ku       Heon
2   27  park4050@snu.ac.kr  Park Sang Hyeon      Park        Sang      Hyeon

In [14]:
df.drop(columns=['full_name'])

   age               email last_name middle_name first_name
0   25   kim1345@gmail.com       Kim         Jae         Hi
1   26   lee1001@naver.com       Lee          Ku       Heon
2   27  park4050@snu.ac.kr      Park        Sang      Hyeon